RT-Thread/rt-thread/bsp/nxp/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_edma.h
/*! @brief _edma_interrupt_enable eDMA interrupt source */
enum
{
    kEDMA_ErrorInterruptEnable = 0x1U,                  /*!< Enable interrupt while channel error occurs. */
    kEDMA_MajorInterruptEnable = DMA_CSR_INTMAJOR_MASK, /*!< Enable interrupt while major count exhausted. */
    kEDMA_HalfInterruptEnable  = DMA_CSR_INTHALF_MASK,  /*!< Enable interrupt while major count to half value. */
};

/*! @brief eDMA transfer type */
typedef enum _edma_transfer_type
{
    kEDMA_MemoryToMemory = 0x0U,  /*!< Transfer from memory to memory */
    kEDMA_PeripheralToMemory,     /*!< Transfer from peripheral to memory */
    kEDMA_MemoryToPeripheral,     /*!< Transfer from memory to peripheral */
    kEDMA_PeripheralToPeripheral, /*!< Transfer from Peripheral to peripheral */
} edma_transfer_type_t;

/*! @brief eDMA channel priority configuration */
typedef struct _edma_channel_Preemption_config
{
    bool enableChannelPreemption; /*!< If true: a channel can be suspended by other channel with higher priority */
    bool enablePreemptAbility;    /*!< If true: a channel can suspend other channel with low priority */
    uint8_t channelPriority;      /*!< Channel priority */
} edma_channel_Preemption_config_t;

/*! @brief eDMA minor offset configuration */
typedef struct _edma_minor_offset_config
{
    bool enableSrcMinorOffset;  /*!< Enable(true) or Disable(false) source minor loop offset. */
    bool enableDestMinorOffset; /*!< Enable(true) or Disable(false) destination minor loop offset. */
    uint32_t minorOffset;       /*!< Offset for a minor loop mapping. */
} edma_minor_offset_config_t;

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG && FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG
#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_MEMORY_ATTRIBUTE && FSL_FEATURE_EDMA_HAS_CHANNEL_MEMORY_ATTRIBUTE
/*! @brief eDMA channel memory attribute */
typedef enum edma_channel_memory_attribute
{
    kEDMA_ChannelNoWriteNoReadNoCacheNoBuffer =
        0x0U, /*!< No write allocate, no read allocate, non-cacheable, non-bufferable. */
    kEDMA_ChannelNoWriteNoReadNoCacheBufferable,   /*!< No write allocate, no read allocate, non-cacheable, bufferable.
                                                    */
    kEDMA_ChannelNoWriteNoReadCacheableNoBuffer,   /*!< No write allocate, no read allocate, cacheable, non-bufferable.
                                                    */
    kEDMA_ChannelNoWriteNoReadCacheableBufferable, /*!< No write allocate, no read allocate, cacheable, bufferable. */
    kEDMA_ChannelNoWriteReadNoCacheNoBuffer,   /*!< No write allocate, read allocate, non-cacheable, non-bufferable. */
    kEDMA_ChannelNoWriteReadNoCacheBufferable, /*!< No write allocate, read allocate, non-cacheable, bufferable. */
    kEDMA_ChannelNoWriteReadCacheableNoBuffer, /*!< No write allocate, read allocate, cacheable, non-bufferable. */
    kEDMA_ChannelNoWriteReadCacheableBufferable, /*!< No write allocate, read allocate, cacheable, bufferable. */
    kEDMA_ChannelWriteNoReadNoCacheNoBuffer,   /*!< write allocate, no read allocate, non-cacheable, non-bufferable. */
    kEDMA_ChannelWriteNoReadNoCacheBufferable, /*!< write allocate, no read allocate, non-cacheable, bufferable. */
    kEDMA_ChannelWriteNoReadCacheableNoBuffer, /*!< write allocate, no read allocate, cacheable, non-bufferable. */
    kEDMA_ChannelWriteNoReadCacheableBufferable, /*!< write allocate, no read allocate, cacheable, bufferable. */
    kEDMA_ChannelWriteReadNoCacheNoBuffer,       /*!< write allocate, read allocate, non-cacheable, non-bufferable. */
    kEDMA_ChannelWriteReadNoCacheBufferable,     /*!< write allocate, read allocate, non-cacheable, bufferable. */
    kEDMA_ChannelWriteReadCacheableNoBuffer,     /*!< write allocate, read allocate, cacheable, non-bufferable. */
    kEDMA_ChannelWriteReadCacheableBufferable,   /*!< write allocate, read allocate, cacheable, bufferable. */
} edma_channel_memory_attribute_t;
#endif

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE && FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE
/*! @brief eDMA4 channel swap size */
typedef enum _edma_channel_swap_size
{
    kEDMA_ChannelSwapDisabled       = 0x0U,  /*!< Swap is disabled. */
    kEDMA_ChannelReadWith8bitSwap   = 0x1U,  /*!< Swap occurs with respect to the read 8bit. */
    kEDMA_ChannelReadWith16bitSwap  = 0x2U,  /*!< Swap occurs with respect to the read 16bit. */
    kEDMA_ChannelReadWith32bitSwap  = 0x3U,  /*!< Swap occurs with respect to the read 32bit. */
    kEDMA_ChannelWriteWith8bitSwap  = 0x9U,  /*!< Swap occurs with respect to the write 8bit. */
    kEDMA_ChannelWriteWith16bitSwap = 0x10U, /*!< Swap occurs with respect to the write 16bit. */
    kEDMA_ChannelWriteWith32bitSwap = 0x11U, /*!< Swap occurs with respect to the write 32bit. */
} edma_channel_swap_size_t;
#endif

/*! @brief eDMA channel system bus information, _edma_channel_sys_bus_info*/
enum
{
#if !(defined(FSL_FEATURE_EDMA_HAS_NO_CH_SBR_ATTR) && FSL_FEATURE_EDMA_HAS_NO_CH_SBR_ATTR)
    kEDMA_AttributeOutput = DMA_CH_SBR_ATTR_MASK, /*!< DMA's AHB system bus attribute output value. */
#endif

    kEDMA_PrivilegedAccessLevel = DMA_CH_SBR_PAL_MASK, /*!< Privileged Access Level for DMA transfers. 0b - User
                                                          protection level; 1b - Privileged protection level. */
    kEDMA_MasterId =
        DMA_CH_SBR_MID_MASK, /*!< DMA's master ID when channel is active and master ID replication is enabled. */
};

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE && FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE
/*! @brief eDMA4 channel access type */
typedef enum _edma_channel_access_type
{
    kEDMA_ChannelDataAccess        = 0x0U, /*!< Data access for eDMA4 transfers. */
    kEDMA_ChannelInstructionAccess = 0x1U, /*!< Instruction access for eDMA4 transfers. */
} edma_channel_access_type_t;
#endif

typedef enum _edma_channel_protection_level
{
    kEDMA_ChannelProtectionLevelUser       = 0x0U, /*!< user protection level for eDMA transfers. */
    kEDMA_ChannelProtectionLevelPrivileged = 0x1U, /*!< Privileged protection level eDMA transfers. */
} edma_channel_protection_level_t;

