RT-Thread/rt-thread/bsp/nxp/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_edma.h
#if !(defined(FSL_FEATURE_EDMA_HAS_NO_CH_SBR_SEC) && FSL_FEATURE_EDMA_HAS_NO_CH_SBR_SEC)
typedef enum _edma_channel_security_level
{
    kEDMA_ChannelSecurityLevelNonSecure = 0x0U, /*!< non secure  level for eDMA transfers. */
    kEDMA_ChannelSecurityLevelSecure    = 0x1U, /*!< secure level for eDMA transfers. */
} edma_channel_security_level_t;
#endif

/*! @brief eDMA4 channel configuration*/
typedef struct _edma_channel_config
{
    edma_channel_Preemption_config_t channelPreemptionConfig; /*!< channel preemption configuration */

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_MEMORY_ATTRIBUTE && FSL_FEATURE_EDMA_HAS_CHANNEL_MEMORY_ATTRIBUTE
    edma_channel_memory_attribute_t channelReadMemoryAttribute;  /*!< channel memory read attribute configuration */
    edma_channel_memory_attribute_t channelWriteMemoryAttribute; /*!< channel memory write attribute configuration */
#endif

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE && FSL_FEATURE_EDMA_HAS_CHANNEL_SWAP_SIZE
    edma_channel_swap_size_t channelSwapSize; /*!< channel swap size configuration */
#endif

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE && FSL_FEATURE_EDMA_HAS_CHANNEL_ACCESS_TYPE
    edma_channel_access_type_t channelAccessType; /*!< channel access type configuration */
#endif

    uint8_t channelDataSignExtensionBitPosition; /*!< channel data sign extension bit psition configuration */

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_MUX && FSL_FEATURE_EDMA_HAS_CHANNEL_MUX
    int channelRequestSource; /*!< hardware service request source for the channel */
#endif

    bool enableMasterIDReplication;                  /*!< enable master ID replication */
#if !(defined(FSL_FEATURE_EDMA_HAS_NO_CH_SBR_SEC) && FSL_FEATURE_EDMA_HAS_NO_CH_SBR_SEC)
    edma_channel_security_level_t securityLevel;     /*!< security level */
#endif
    edma_channel_protection_level_t protectionLevel; /*!< protection level */

} edma_channel_config_t;
#endif

/*!
 * @brief eDMA TCD.
 *
 * This structure is same as TCD register which is described in reference manual,
 * and is used to configure the scatter/gather feature as a next hardware TCD.
 */
typedef edma_core_tcd_t edma_tcd_t;

/*! @brief edma4 channel transfer configuration
 *
 * The transfer configuration structure support full feature configuration of the transfer control descriptor.
 *
 * @note User should pay attention to the transfer size alignment limitation
 *       1. the bytesEachRequest should align with the  srcWidthOfEachTransfer and the dstWidthOfEachTransfer
 *          that is to say bytesEachRequest % srcWidthOfEachTransfer should be 0
 *       2. the srcOffsetOfEachTransfer and dstOffsetOfEachTransfer must be aligne with transfer width
 *       3. the totalBytes should align with the bytesEachRequest
 *       4. the srcAddr should align with the srcWidthOfEachTransfer
 *       5. the dstAddr should align with the dstWidthOfEachTransfer
 *       6. the srcAddr should align with srcAddrModulo if modulo feature is enabled
 *       7. the dstAddr should align with dstAddrModulo if modulo feature is enabled
 *       If anyone of above condition can not be satisfied, the edma4 interfaces will generate assert error.
 *
 * 1.To perform a simple transfer, below members should be initialized at least
 * .srcAddr - source address
 * .dstAddr - destination address
 * .srcWidthOfEachTransfer - data width of source address
 * .dstWidthOfEachTransfer - data width of destination address, normally it should be as same as
 * srcWidthOfEachTransfer .bytesEachRequest - bytes to be transferred in each DMA request .totalBytes - total
 * bytes to be transferred .srcOffsetOfEachTransfer - offset value in bytes unit to be applied to source address as
 * each source read is completed .dstOffsetOfEachTransfer - offset value in bytes unit to be applied to destination
 * address as each destination write is completed enablchannelRequest - channel request can be enabled together with
 * transfer configure submission
 *
 * 2.The transfer configuration structure also support advance feature:
 * Programmable source/destination address range(MODULO)
 * Programmable minor loop offset
 * Programmable major loop offset
 * Programmable channel chain feature
 * Programmable channel transfer control descriptor link feature
 *
 */
typedef struct _edma_transfer_config
{
    uint32_t srcAddr;                      /*!< Source data address. */
    uint32_t destAddr;                     /*!< Destination data address. */
    edma_transfer_size_t srcTransferSize;  /*!< Source data transfer size. */
    edma_transfer_size_t destTransferSize; /*!< Destination data transfer size. */
    int16_t srcOffset;                     /*!< Sign-extended offset value in byte unit applied to the current source
                                                address to form the next-state   value as each source read is completed */
    int16_t destOffset;       /*!< Sign-extended offset value in byte unit applied to the current destination
                  address to form the next-state value as each destination write is completed. */
    uint32_t minorLoopBytes;  /*!< bytes in each minor loop or each request
                               * range: 1 - (2^30 -1) when minor loop mapping is enabled
                               * range: 1 - (2^10 - 1) when minor loop mapping is enabled and source or dest minor
                               * loop offset is enabled
                               * range: 1 - (2^32 - 1) when minor loop mapping is disabled
                               */
    uint32_t majorLoopCounts; /*!< minor loop counts in each major loop, should be 1 at least for each
                               * transfer range: (0 - (2^15 - 1)) when minor loop channel link is
                               * disabled range: (0 - (2^9 - 1)) when minor loop channel link is enabled
                               * total bytes in a transfer = minorLoopCountsEachMajorLoop *
                               * bytesEachMinorLoop
                               */

    uint16_t enabledInterruptMask; /*!< channel interrupt to enable, can be OR'ed value of @ref
                                         _edma_channel_interrupt_enable */

    edma_modulo_t srcAddrModulo; /*!< source circular data queue range */
    int32_t srcMajorLoopOffset;  /*!< source major loop offset */

    edma_modulo_t dstAddrModulo; /*!< destination circular data queue range */
    int32_t dstMajorLoopOffset;  /*!< destination major loop offset */

    bool enableSrcMinorLoopOffset; /*!< enable source minor loop offset */
    bool enableDstMinorLoopOffset; /*!< enable dest minor loop offset */
    int32_t minorLoopOffset;       /*!< burst offset, the offset will be applied after minor loop update */

    bool enableChannelMajorLoopLink; /*!< channel link when major loop complete */
    uint32_t majorLoopLinkChannel;   /*!< major loop link channel number */

    bool enableChannelMinorLoopLink; /*!< channel link when minor loop complete */
    uint32_t minorLoopLinkChannel;   /*!< minor loop link channel number */

    edma_tcd_t *linkTCD; /*!< pointer to the link transfer control descriptor */
} edma_transfer_config_t;

/*! @brief eDMA global configuration structure.*/
typedef struct _edma_config
{
#if defined FSL_FEATURE_EDMA_HAS_CONTINUOUS_LINK_MODE && FSL_FEATURE_EDMA_HAS_CONTINUOUS_LINK_MODE
    bool enableContinuousLinkMode; /*!< Enable (true) continuous link mode. Upon minor loop completion, the channel
                                        activates again if that channel has a minor loop channel link enabled and
                                        the link channel is itself. */
#endif

#if defined FSL_FEATURE_EDMA_HAS_GLOBAL_MASTER_ID_REPLICATION && FSL_FEATURE_EDMA_HAS_GLOBAL_MASTER_ID_REPLICATION
    bool enableMasterIdReplication; /*!< Enable (true) master ID replication. If Master ID replication is disabled, the
                                        privileged protection level (supervisor mode) for eDMA4 transfers is used. */
#endif

    bool enableGlobalChannelLink; /*!< Enable(true) channel linking is available and controlled by each channel's link
                                     settings. */

    bool enableHaltOnError; /*!< Enable (true) transfer halt on error. Any error causes the HALT bit to set.
                          Subsequently, all service requests are ignored until the HALT bit is cleared.*/

    bool enableDebugMode; /*!< Enable(true) eDMA4 debug mode. When in debug mode, the eDMA4 stalls the start of
                               a new channel. Executing channels are allowed to complete. */

