RT-Thread/rt-thread/bsp/nxp/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_edma.h
    bool enableRoundRobinArbitration; /*!< Enable(true) channel linking is available and controlled by each channel's
                                     link settings. */
#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG && FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG
    edma_channel_config_t *channelConfig[FSL_FEATURE_EDMA_MODULE_CHANNEL]; /*!< channel preemption configuration */
#endif
} edma_config_t;

/*! @brief Callback for eDMA */
struct _edma_handle;

/*! @brief Define callback function for eDMA.
 *
 * This callback function is called in the EDMA interrupt handle.
 * In normal mode, run into callback function means the transfer users need is done.
 * In scatter gather mode, run into callback function means a transfer control block (tcd) is finished. Not
 * all transfer finished, users can get the finished tcd numbers using interface EDMA_GetUnusedTCDNumber.
 *
 * @param handle EDMA handle pointer, users shall not touch the values inside.
 * @param userData The callback user parameter pointer. Users can use this parameter to involve things users need to
 *                 change in EDMA callback function.
 * @param transferDone If the current loaded transfer done. In normal mode it means if all transfer done. In scatter
 *                     gather mode, this parameter shows is the current transfer block in EDMA register is done. As the
 *                     load of core is different, it will be different if the new tcd loaded into EDMA registers while
 *                     this callback called. If true, it always means new tcd still not loaded into registers, while
 *                     false means new tcd already loaded into registers.
 * @param tcds How many tcds are done from the last callback. This parameter only used in scatter gather mode. It
 *             tells user how many tcds are finished between the last callback and this.
 */
typedef void (*edma_callback)(struct _edma_handle *handle, void *userData, bool transferDone, uint32_t tcds);

/*! @brief eDMA transfer handle structure */
typedef struct _edma_handle
{
    edma_callback callback; /*!< Callback function for major count exhausted. */
    void *userData;         /*!< Callback function parameter. */

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG && FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG
    EDMA_ChannelType *channelBase; /*!< eDMA peripheral channel base address. */
#endif
    EDMA_Type *base;       /*!< eDMA peripheral base address*/
    EDMA_TCDType *tcdBase; /*!< eDMA peripheral tcd base address. */

    edma_tcd_t *tcdPool; /*!< Pointer to memory stored TCDs. */
    uint32_t channel;    /*!< eDMA channel number. */

    volatile int8_t header; /*!< The first TCD index. Should point to the next TCD to be loaded into the eDMA engine. */
    volatile int8_t tail;   /*!< The last TCD index. Should point to the next TCD to be stored into the memory pool. */
    volatile int8_t tcdUsed; /*!< The number of used TCD slots. Should reflect the number of TCDs can be used/loaded in
                                the memory. */
    volatile int8_t tcdSize; /*!< The total number of TCD slots in the queue. */
} edma_handle_t;
/*******************************************************************************
 * APIs
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @name eDMA initialization and de-initialization
 * @{
 */

/*!
 * @brief Initializes the eDMA peripheral.
 *
 * This function ungates the eDMA clock and configures the eDMA peripheral according
 * to the configuration structure.
 *
 * @param base eDMA peripheral base address.
 * @param config A pointer to the configuration structure, see "edma_config_t".
 * @note This function enables the minor loop map feature.
 */
void EDMA_Init(EDMA_Type *base, const edma_config_t *config);

/*!
 * @brief Deinitializes the eDMA peripheral.
 *
 * This function gates the eDMA clock.
 *
 * @param base eDMA peripheral base address.
 */
void EDMA_Deinit(EDMA_Type *base);

/*!
 * @brief Push content of TCD structure into hardware TCD register.
 *
 * @param base EDMA peripheral base address.
 * @param channel EDMA channel number.
 * @param tcd Point to TCD structure.
 */
void EDMA_InstallTCD(EDMA_Type *base, uint32_t channel, const edma_tcd_t *tcd);

/*!
 * @brief Gets the eDMA default configuration structure.
 *
 * This function sets the configuration structure to default values.
 * The default configuration is set to the following values.
 * @code
 *   config.enableContinuousLinkMode = false;
 *   config.enableHaltOnError = true;
 *   config.enableRoundRobinArbitration = false;
 *   config.enableDebugMode = false;
 * @endcode
 *
 * @param config A pointer to the eDMA configuration structure.
 */
void EDMA_GetDefaultConfig(edma_config_t *config);

#if defined(FSL_FEATURE_DMA_HAS_CONTINUOUS_CHANNEL_LINK) && FSL_FEATURE_DMA_HAS_CONTINUOUS_CHANNEL_LINK
/*!
 * @brief Enable/Disable continuous channel link mode.
 *
 * @note Do not use continuous link mode with a channel linking to itself if there is only one minor loop
 * iteration per service request, for example, if the channel's NBYTES value is the same as either
 * the source or destination size. The same data transfer profile can be achieved by simply
 * increasing the NBYTES value, which provides more efficient, faster processing.
 *
 * @param base EDMA peripheral base address.
 * @param enable true is enable, false is disable.
 */
static inline void EDMA_EnableContinuousChannelLinkMode(EDMA_Type *base, bool enable)
{
    if (enable)
    {
        EDMA_BASE(base)->CR |= DMA_CR_CLM_MASK;
    }
    else
    {
        EDMA_BASE(base)->CR &= ~DMA_CR_CLM_MASK;
    }
}
#endif

#if defined(FSL_FEATURE_DMA_HAS_MINOR_LOOP_MAPPING) && FSL_FEATURE_DMA_HAS_MINOR_LOOP_MAPPING
/*!
 * @brief Enable/Disable minor loop mapping.
 *
 * The TCDn.word2 is redefined to include individual enable fields, an offset field, and the
 * NBYTES field.
 *
 * @param base EDMA peripheral base address.
 * @param enable true is enable, false is disable.
 */
static inline void EDMA_EnableMinorLoopMapping(EDMA_Type *base, bool enable)
{
    if (enable)
    {
        EDMA_BASE(base)->CR |= DMA_CR_EMLM_MASK;
    }
    else
    {
        EDMA_BASE(base)->CR &= ~DMA_CR_EMLM_MASK;
    }
}
#endif

/* @} */
/*!
 * @name eDMA Channel Operation
 * @{
 */

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG && FSL_FEATURE_EDMA_HAS_CHANNEL_CONFIG
/*!
 * @brief EDMA Channel initialization
 *
 * @param base eDMA4 peripheral base address.
 * @param channel eDMA4 channel number.
 * @param channelConfig pointer to user's eDMA4 channel config structure, see edma_channel_config_t for detail.
 */
void EDMA_InitChannel(EDMA_Type *base, uint32_t channel, edma_channel_config_t *channelConfig);

#if defined FSL_FEATURE_EDMA_HAS_CHANNEL_MEMORY_ATTRIBUTE && FSL_FEATURE_EDMA_HAS_CHANNEL_MEMORY_ATTRIBUTE
/*!
 * @brief Set channel memory attribute.
 *
 * @param base eDMA4 peripheral base address.
 * @param channel eDMA4 channel number.
 * @param writeAttribute Attributes associated with a write transaction.
 * @param readAttribute Attributes associated with a read transaction.
 */
static inline void EDMA_SetChannelMemoryAttribute(EDMA_Type *base,
                                                  uint32_t channel,
                                                  edma_channel_memory_attribute_t writeAttribute,
                                                  edma_channel_memory_attribute_t readAttribute)
{
    assert(channel < (uint32_t)FSL_FEATURE_EDMA_INSTANCE_CHANNELn(base));

    if (0U != (uint32_t)FSL_FEATURE_EDMA_INSTANCE_HAS_CHANNEL_MEMORY_ATTRIBUTEn(base))
    {
        EDMA_CHANNEL_BASE(base, channel)->CH_MATTR =
            DMA_CH_MATTR_WCACHE(writeAttribute) | DMA_CH_MATTR_RCACHE(readAttribute);
    }
}
#endif

